src/cf/Documents/ПриказОбУвольнении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПриказОбУвольнении</Name>
			<BasedOn>
				<xr:Item>Document.ПриказОПриеме</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ПриказОбУвольнении/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	СотрудникОбъект.Родитель = Справочники.ФизическиеЛица.УВОЛЕННЫЕ;
	СотрудникОбъект.Записать();

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	СотрудникОбъект.Родитель = Справочники.ФизическиеЛица.РАБОТАЮЩИЕ;
	СотрудникОбъект.Записать();

КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
	КонецЕсли;

КонецПроцедуры
